БухЭксп/Catalogs/CW_ВебПользователиЛКК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПользователиЛКК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПечатныеФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентифкаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеПользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофилиПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофилиПеревозок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВебПрофили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхива</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофилиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофилиЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВебПрофили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхива</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыФиксацииКолонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БыстрыйОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФормат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеТипаЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПользователиЛКК/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОжиданиеПроверкиОшибка.Видимость = Ложь; 
	Элементы.ГруппаОжиданиеПроверки.Видимость 		= Ложь;
	
	МожноЗаписатьПользователя = истина;   
	Элементы.ГруппаПользовательСуществует.Видимость = Ложь;
	
	Если Параметры.Ключ.Пустая() Тогда
		НужноУстановитьПароль = Истина;
		Объект.Язык = Справочники.CW_Языки.ru;
		Заголовок = "Новый пользователь";
	Иначе
		Заголовок = Объект.Наименование;
	КонецЕсли;
	
	Элементы.Язык.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.CW_Языки.ru")); 
	Элементы.Язык.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.CW_Языки.en"));
	
	ЗаполнитьДоступныеВебПрофили();
	ПолучитьДанныеПользователя();
	УправлениеЭлементамиФормы(); 
	
КонецПроцедуры


&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.РазрешенДоступПоAPI.Видимость 						= ИспользуетсяAPI;
	Элементы.КлючДоступаAPI.Видимость 							= ИспользуетсяAPI и РазрешенДоступПоAPI;
	Элементы.ГруппаОшибкаИдентфикации.Видимость 				= Не ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	Элементы.УстановитьПароль.Доступность 						= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя) или Не ПарольУстановлен;
	Элементы.ОтправитьПользователюПриглашение.Доступность 		= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	Элементы.ОтправитьПользователюВременныйПароль.Доступность 	= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	
	Элементы.НадписьУстановитеПароль.Видимость = НужноУстановитьПароль и Не ПарольУстановлен;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеВебПрофили()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеПользователи.ВебПрофиль КАК ВебПрофиль,
	               |	CW_ДоступныеПользователи.ВебПрофиль.ДоступенРазделПеревозки КАК ДоступенРазделГрузоперевозки,
	               |	CW_ДоступныеПользователи.ВебПрофиль.ДоступенРазделЗаявки КАК ДоступенРазделЗаявки
	               |ПОМЕСТИТЬ ВТ_ДоступныеОсновныеПрофили
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеПользователи КАК CW_ДоступныеПользователи
	               |ГДЕ
	               |	CW_ДоступныеПользователи.Пользователь = &Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоступныеОсновныеПрофили.ВебПрофиль КАК ВебПрофиль,
	               |	ВТ_ДоступныеОсновныеПрофили.ДоступенРазделГрузоперевозки КАК ДоступенРазделГрузоперевозки,
	               |	ВТ_ДоступныеОсновныеПрофили.ДоступенРазделЗаявки КАК ДоступенРазделЗаявки
	               |ИЗ
	               |	ВТ_ДоступныеОсновныеПрофили КАК ВТ_ДоступныеОсновныеПрофили
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ВебПрофилиПеревозок.Владелец КАК ОсновнойПрофиль,
	               |	CW_ВебПрофилиПеревозок.Ссылка КАК Профиль,
	               |	CW_ВебПрофилиПеревозок.Активный КАК Активный,
	               |	ВЫБОР
	               |		КОГДА CW_ПользователиВебПрофилей.ВебПрофиль ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Использование,
	               |	ЕСТЬNULL(CW_ПользователиВебПрофилей.Основной, ЛОЖЬ) КАК Основной
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиПеревозок КАК CW_ВебПрофилиПеревозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	               |		ПО CW_ВебПрофилиПеревозок.Ссылка = CW_ПользователиВебПрофилей.ВебПрофиль
	               |			И (CW_ПользователиВебПрофилей.Пользователь = &Пользователь)
	               |ГДЕ
	               |	CW_ВебПрофилиПеревозок.Владелец В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДоступныеОсновныеПрофили.ВебПрофиль КАК ВебПрофиль
	               |			ИЗ
	               |				ВТ_ДоступныеОсновныеПрофили КАК ВТ_ДоступныеОсновныеПрофили)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ВебПрофилиЗаявок.Владелец КАК ОсновнойПрофиль,
	               |	CW_ВебПрофилиЗаявок.Ссылка КАК Профиль,
	               |	CW_ВебПрофилиЗаявок.Активный КАК Активный,
	               |	ВЫБОР
	               |		КОГДА CW_ПользователиВебПрофилей.ВебПрофиль ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Использование,
	               |	ЕСТЬNULL(CW_ПользователиВебПрофилей.Основной, ЛОЖЬ) КАК Основной
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	               |		ПО CW_ВебПрофилиЗаявок.Ссылка = CW_ПользователиВебПрофилей.ВебПрофиль
	               |			И (CW_ПользователиВебПрофилей.Пользователь = &Пользователь)
	               |ГДЕ
	               |	CW_ВебПрофилиЗаявок.Владелец В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДоступныеОсновныеПрофили.ВебПрофиль КАК ВебПрофиль
	               |			ИЗ
	               |				ВТ_ДоступныеОсновныеПрофили КАК ВТ_ДоступныеОсновныеПрофили)"; 
	
	Запрос.УстановитьПараметр("Пользователь", Объект.Ссылка);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();    
	
	РезультатОсновнойПрофиль		= ПакетРезультатовЗапроса[1];
	
	РезультатПрофильГрузоперевозок 	= ПакетРезультатовЗапроса[2]; 
	ТаблицаПрофильГрузоперевозок 	= РезультатПрофильГрузоперевозок.Выгрузить();
	
	РезультатПрофильЗаявок 			= ПакетРезультатовЗапроса[3];
	ТаблицаПрофильЗаявок 			= РезультатПрофильЗаявок.Выгрузить();  
	
	ЭлементыДерева = ДоступныеПрофили.ПолучитьЭлементы();
	
	ВыборкаОсновнойПрофиль = РезультатОсновнойПрофиль.Выбрать();
	Пока ВыборкаОсновнойПрофиль.Следующий() Цикл
		
		ГруппаДерева = ЭлементыДерева.Добавить();
		ГруппаДерева.Профиль 		= ВыборкаОсновнойПрофиль.ВебПрофиль;
		ГруппаДерева.ИндексКартинки = 0;
		ГруппаДерева.Активный 		= ИСТИНА;   
		ГруппаДерева.ЭтоГруппа      = ИСТИНА;
		
		Отбор = Новый Структура("ОсновнойПрофиль",  ВыборкаОсновнойПрофиль.ВебПрофиль); 
		
		Если ВыборкаОсновнойПрофиль.ДоступенРазделГрузоперевозки Тогда
			мСтроки = ТаблицаПрофильГрузоперевозок.НайтиСтроки(Отбор); 
			Если мСтроки.Количество() > 0 Тогда
				ЭлементыВидПрофиля = ГруппаДерева.ПолучитьЭлементы();
				ГруппыДереваВидПрофиля = ЭлементыВидПрофиля.Добавить();
				ГруппыДереваВидПрофиля.Профиль 			= "ГРУЗОПЕРЕВОЗКИ";
				ГруппыДереваВидПрофиля.ИндексКартинки 	= 1;
				ГруппыДереваВидПрофиля.Активный 		= ИСТИНА; 
				ГруппыДереваВидПрофиля.ЭтоГруппа      	= ИСТИНА;
				
				ЭлементыГруппы = ГруппыДереваВидПрофиля.ПолучитьЭлементы();
				Для каждого СтрокаМассива из мСтроки Цикл
					НоваяСтрока = ЭлементыГруппы.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива); 
					
					НоваяСтрока.Раздел = "ГРУЗОПЕРЕВОЗКИ"; 
					НоваяСтрока.ИндексКартинки = 2; 
				КонецЦикла;   
				
				ГруппыДереваВидПрофиля.Использование = ПолучитьПометкуРодителяНаСервере(ЭлементыГруппы)
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаОсновнойПрофиль.ДоступенРазделЗаявки Тогда
			мСтроки = ТаблицаПрофильЗаявок.НайтиСтроки(Отбор); 
			Если мСтроки.Количество() > 0 Тогда
				ЭлементыВидПрофиля = ГруппаДерева.ПолучитьЭлементы();
				ГруппыДереваВидПрофиля = ЭлементыВидПрофиля.Добавить();
				ГруппыДереваВидПрофиля.Профиль 			= "ЗАЯВКИ";
				ГруппыДереваВидПрофиля.ИндексКартинки 	= 1;
				ГруппыДереваВидПрофиля.Активный 		= ИСТИНА; 
				ГруппыДереваВидПрофиля.ЭтоГруппа      	= ИСТИНА;
				
				ЭлементыГруппы = ГруппыДереваВидПрофиля.ПолучитьЭлементы();
				Для каждого СтрокаМассива из мСтроки Цикл
					НоваяСтрока = ЭлементыГруппы.Добавить(); 
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива); 
					
					НоваяСтрока.Раздел = "ЗАЯВКИ"; 
					НоваяСтрока.ИндексКартинки = 2;
				КонецЦикла;  
				
				ГруппыДереваВидПрофиля.Использование = ПолучитьПометкуРодителяНаСервере(ЭлементыГруппы)
			КонецЕсли;
		КонецЕсли;
	
		ГруппаДерева.Использование = ПолучитьПометкуРодителяНаСервере(ГруппаДерева.ПолучитьЭлементы())
		
	КонецЦикла;
	
	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();   
	
	ДеревоПрофилей = РеквизитФормыВЗначение("ДоступныеПрофили");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоГруппа", 		Ложь);
	СтруктураОтбора.Вставить("Использование", 	1);
	
	ПомеченныеСтроки = ДеревоПрофилей.Строки.НайтиСтроки(СтруктураОтбора, Истина);  
	Для Каждого СтрокаДерева из ПомеченныеСтроки Цикл 
		ЗаписьНабора = НаборЗаписей.Добавить();   
		ЗаписьНабора.Пользователь 		= Объект.Ссылка;
		ЗаписьНабора.Раздел  	   		= СтрокаДерева.Раздел;
		ЗаписьНабора.ВебПрофиль 		= СтрокаДерева.Профиль;
		ЗаписьНабора.ОсновнойПрофиль 	= СтрокаДерева.Профиль.Владелец;
		ЗаписьНабора.Основной 			= СтрокаДерева.Основной;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Заголовок = ТекущийОбъект.Наименование;
	
	Элементы.ГруппаОшибкаИдентфикации.Видимость 				= Не ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	Элементы.УстановитьПароль.Доступность 						= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	Элементы.ОтправитьПользователюПриглашение.Доступность 		= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	Элементы.ОтправитьПользователюВременныйПароль.Доступность 	= ЗначениеЗаполнено(Объект.ИдентифкаторПользователя);
	
	УстановленНовыйПароль	= Ложь;
	ПарольУстановлен 		= Истина;
	ВременныйПароль			= "";
	
	Элементы.НадписьУстановитеПароль.Видимость = НЕ ПарольУстановлен;
	
	ПолучитьДанныеПользователя();
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    

	Если СтрНайти(Объект.ЭлектроннаяПочта,"@") = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указан некорректный адрес электронной почты!",,"ЭлектроннаяПочта","Объект", Отказ);			
	КонецЕсли;
	
	Если Не АдресУникальный(Объект.ЭлектроннаяПочта, Объект.Ссылка) Тогда   
		Отказ = Истина;
		ВызватьИсключение "В этой базе данных пользователь с таким электронным адресом уже существует! Запись невозможна!";
	КонецЕсли;   
	
	Если НЕ МожноЗаписатьПользователя Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В сервисе ""Личный кабинет клиента"" пользователь с таким электронным адресом уже зарегистрирован!",,"ЭлектроннаяПочта","Объект", Отказ);			
	КонецЕсли;
	
	Если НужноУстановитьПароль Тогда
		Если НЕ ПарольУстановлен и Не УстановленНовыйПароль Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо установить временный пароль!",,"ИдентифкаторПользователя","Объект", Отказ);			
		КонецЕсли;                      
	Конецесли;  
	
	Ответ = ОбновитьДанныеПользователяЛичногоКабинета(Отказ);
	
	Состояние(Ответ.Текст,,Ответ.Пояснение);
	
КонецПроцедуры   


Функция ОбновитьДанныеПользователяЛичногоКабинета(Отказ) 
	
	СоответствиеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
	
	Если Объект.ПометкаУдаления Тогда
		АктивныйПользователь 	= Ложь;
		РазрешенДоступПоAPI 	= Ложь;
	КонецЕсли;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("name",		XMLСтрока(Объект.ЭлектроннаяПочта));		
	СтруктураJSON.Вставить("email",		XMLСтрока(Объект.ЭлектроннаяПочта));
	
	СтруктураJSON.Вставить("active",	XMLСтрока(АктивныйПользователь));
	СтруктураJSON.Вставить("language",	XMLСтрока(Объект.Язык.Код));
	СтруктураJSON.Вставить("userid",	XMLСтрока(Объект.ИдентифкаторПользователя));
	
	СтруктураJSON.Вставить("showfiles",	XMLСтрока(Объект.ВыгружатьФайлы));
	СтруктураJSON.Вставить("showdocs",	XMLСтрока(Объект.ВыгружатьПечатныеФормы));
	СтруктураJSON.Вставить("create",	XMLСтрока(Не Объект.ПометкаУдаления));
	
	СтруктураJSON.Вставить("requirepasswordchange", XMLСтрока(ПотребоватьСменыПароляПриВходе));
	
	СтруктураJSON.Вставить("usedapi",	XMLСтрока(РазрешенДоступПоAPI));
	
	Если УстановленНовыйПароль Тогда
		СтруктураJSON.Вставить("password", XMLСтрока(ВременныйПароль));
	КонецЕсли;
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_updateuser", СтруктураJSON);
 	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 

	Если Ответ = Неопределено Тогда  
		Структура = новый Структура;
		Структура.Вставить("Текст", 	"Не удалось обновить данные пользователя");
		Структура.Вставить("Пояснение", "Отсутствует интернет-соединение!");
		Возврат Структура;
	КонецЕсли;

	Структура = новый Структура("Текст,Пояснение", "", "");
	
	Если Ответ.КодСостояния = 200 Тогда   
		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		Если СтруктураJSON.Свойство("userid") Тогда
			Объект.ИдентифкаторПользователя  =  XMLЗначение(Тип("Строка"), СтруктураJSON.userid);
		КонецЕсли; 
		
		Структура.Текст 		= "Пользователь записан";
		Структура.Пояснение 	= СтруктураJSON.info;
	Иначе  
		Структура.Текст 		= "Не удалось обновить данные пользователя";
		Структура.Пояснение 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли; 
	
	Возврат Структура;
	
КонецФункции



&НаСервереБезКонтекста
Функция АдресУникальный(ЭлектроннаяПочта, ТекущаяСсылка)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ВебПользователиЛКК.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ВебПользователиЛКК КАК CW_ВебПользователиЛКК
	               |ГДЕ
	               |	CW_ВебПользователиЛКК.Ссылка <> &Ссылка
	               |	И CW_ВебПользователиЛКК.ЭлектроннаяПочта = &ЭлектроннаяПочта";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСсылка); 
	Запрос.УстановитьПараметр("ЭлектроннаяПочта", ЭлектроннаяПочта); 
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Пустой();
		
КонецФункции

&НаКлиенте
Процедура ОтправитьПользователюВременныйПароль(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записить пользователя!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОтправитьПользователюВременныйПароль", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Для учетной записи текущего пользоватея личного кабинета будет сгенерирован новый пароль. Продлжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправитьПользователюВременныйПароль(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  ОтправитьПользователюПарольВФоне();
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьОтветСервера", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОтправитьПользователюПарольВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Отправка пользователю пароля";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ИдентифкаторПользователя", Объект.ИдентифкаторПользователя);
	ПараметрыПроцедуры.Вставить("ЭлектроннаяПочта", Объект.ЭлектроннаяПочта);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбщийМодульЛичныйКабинетСервер.ОтправитьПользователюПароль",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура ОбработатьОтветСервера(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если СтруктураОтвета.ОшибкаОтправки Тогда
			ТекстПредупреждения = ?(ПустаяСтрока(СтруктураОтвета.ТекстОшибки), "Не удалось отправить по указаному адресу!", СтруктураОтвета.ТекстОшибки);
			ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка отправки сообщения");
		Иначе
			ПоказатьПредупреждение(,"Пользователю отправлен временный пароль");
		КонецЕсли;
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка отправки пароля пользователю!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка отправки пароля пользователю");
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьПользователюПриглашение(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОтправитьПользователюПриглашение", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Для учетной записи текущего пользоватея личного кабинета будет сгенерирован новый пароль. Продлжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправитьПользователюПриглашение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  ОтправитьПользователюПриглашениеВФоне();
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьОтправкуПриглашения", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры


&НаСервере
Функция ОтправитьПользователюПриглашениеВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Отправка пользователю приглашения в сервис";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ИдентифкаторПользователя", Объект.ИдентифкаторПользователя);
	ПараметрыПроцедуры.Вставить("ЭлектроннаяПочта", 		Объект.ЭлектроннаяПочта);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбщийМодульЛичныйКабинетСервер.ОтправитьПользователюПриглашение",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура ОбработатьОтправкуПриглашения(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если СтруктураОтвета.ОшибкаОтправки Тогда
			ТекстПредупреждения = ?(ПустаяСтрока(СтруктураОтвета.ТекстОшибки), "Не удалось отправить по указаному адресу!", СтруктураОтвета.ТекстОшибки);
			ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка отправки сообщения");
		Иначе
			ПоказатьПредупреждение(,"Пользователю отправлено приглашение");
		КонецЕсли;
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка отправки приглашения пользователю!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка отправки приглашения пользователю");
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПрофилиДоступаСнятьПометки(Команда)
	
	ПрофилиОбработатьПометки(0);  
	Если ТребуетсяУведомлениеПоРегламенту тогда 
		ПоказатьПредупреждение(,"Проверьте настройки регламентных заданий.");
		ТребуетсяУведомлениеПоРегламенту = Ложь;
		УстановитьОформлениеКнопки(Ложь);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПрофилиДоступаУстановитьПометки(Команда)
	ПрофилиОбработатьПометки(1);
КонецПроцедуры

&НаКлиенте
Процедура ПрофилиОбработатьПометки(Использование) 
	
	ЭлементыДерева = ДоступныеПрофили.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева.Использование = Использование;
		ОбработатьПодчиненныеЭлементы(СтрокаДерева.ПолучитьИдентификатор());  
	КонецЦикла;                                    
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПароль(Команда)

	Оповещение = Новый ОписаниеОповещения("ОбработатьВводНовогоПароля", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетИзменитьПарольПользователя",,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводНовогоПароля(ДанныеПароля, Параметры) Экспорт
	
	Если ДанныеПароля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановленНовыйПароль 	= Истина;
	ВременныйПароль 		= ДанныеПароля.Пароль;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновным(Команда)
	
	ТекущиеДанные = Элементы.ДоступныеПрофили.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать элемент, а не группу профилей!");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДоступныеПрофили.ТекущаяСтрока;
	УстановитьОсновнойПрофиль(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойПрофиль(ТекущаяСтрока) 
	
	СтрокаТекущкя 	= ДоступныеПрофили.НайтиПоИдентификатору(ТекущаяСтрока);  
	СтрокаТекущкя.Основной = Истина;
	
	ТекущийРодитель = СтрокаТекущкя.ПолучитьРодителя();
	СтрокиГруппы 	= ТекущийРодитель.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из СтрокиГруппы Цикл
		ИдентфикаторСтроки = СтрокаДерева.ПолучитьИдентификатор(); 
		Если ИдентфикаторСтроки <> ТекущаяСтрока Тогда
			СтрокаДерева.Основной = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПрофилиИспользованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоступныеПрофили.ТекущиеДанные;
	ТекущиеДанные.Использование = ?(ТекущиеДанные.Использование = 2, 0, ТекущиеДанные.Использование);

	ОбработатьПодчиненныеЭлементы(Элементы.ДоступныеПрофили.ТекущаяСтрока);
	УстановитьФлагРодителя(Элементы.ДоступныеПрофили.ТекущаяСтрока);
	
	Если ТекущиеДанные.Использование = 0 Тогда  
		Если ТребуетсяУведомлениеПоРегламенту тогда
			ПоказатьПредупреждение(,"Проверьте настройки регламентных заданий.");
			ТребуетсяУведомлениеПоРегламенту = Ложь;
			УстановитьОформлениеКнопки(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодчиненныеЭлементы(ИдентифкаторСтроки)
	
	ГруппаДерева = ДоступныеПрофили.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	ЭлементыСтроки = ГруппаДерева.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыСтроки Цикл
		СтрокаДерева.Использование = ГруппаДерева.Использование;  
		Если СтрокаДерева.ЭтоГруппа Тогда
			ОбработатьПодчиненныеЭлементы(СтрокаДерева.ПолучитьИдентификатор())
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагРодителя(ИдентифкаторСтроки)
	
	СтрокаДерева 	= ДоступныеПрофили.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	ГруппаДерева 	= СтрокаДерева.ПолучитьРодителя();
	Пока ГруппаДерева <> Неопределено Цикл
		ГруппаДерева.Использование = ПолучитьПометкуРодителяНаКлиенте(ГруппаДерева.ПолучитьЭлементы());
		ГруппаДерева 	= ГруппаДерева.ПолучитьРодителя();
	КонецЦикла;
	
КонецПроцедуры     

&НаКлиенте
Функция ПолучитьПометкуРодителяНаКлиенте(ЭлементыДерева)
	
	Пометка = Неопределено;
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл 
		Если Пометка = Неопределено Тогда
			Пометка = ЭлементДерева.Использование;
		Иначе
			Если Пометка <> ЭлементДерева.Использование Тогда
				Пометка = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Пометка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Пометка; 
	
КонецФункции

&НаСервере
Функция ПолучитьПометкуРодителяНаСервере(ЭлементыДерева)
	
	Пометка = Неопределено;
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл 
		Если Пометка = Неопределено Тогда
			Пометка = ЭлементДерева.Использование;
		Иначе
			Если Пометка <> ЭлементДерева.Использование Тогда
				Пометка = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Пометка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Пометка; 
	
КонецФункции


&НаКлиенте
Процедура ЭлектроннаяПочтаПриИзменении(Элемент)   
	
	РезультатВыполнения = ВыполнитьПроверкуСуществованияПользователяВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПроверки", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция ВыполнитьПроверкуСуществованияПользователяВФоне() 
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	МожноЗаписатьПользователя 	= Истина;
	НужноУстановитьПароль		= Истина;
	Элементы.ГруппаОжиданиеПроверки.Видимость 		= Истина;
	Элементы.ГруппаПользовательСуществует.Видимость	= Ложь;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Проверка пользователя";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭлектроннаяПочта",			Объект.ЭлектроннаяПочта);
 	ПараметрыПроцедуры.Вставить("ИдентифкаторПользователя",	Объект.ИдентифкаторПользователя);

	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбщийМодульЛичныйКабинетСервер.ВыполнитьПроверкуСуществованияПользователя",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура ОбработатьРезультатПроверки(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		РезультатПроверки 				= ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		УстановитеПарольВидимость = Истина;
		Если РезультатПроверки.ПользовательСуществует 
			И Объект.ИдентифкаторПользователя <> СокрЛП(РезультатПроверки.ИдентифкаторПользователя) Тогда  
			ИдентифкаторПользователя 	= РезультатПроверки.ИдентифкаторПользователя;
			НужноУстановитьПароль		= Ложь;
			МожноЗаписатьПользователя 	= Ложь;
			УстановитеПарольВидимость  = Ложь;
		КонецЕсли;
		
		Элементы.ГруппаПользовательСуществует.Видимость = НЕ МожноЗаписатьПользователя;
		Элементы.НадписьУстановитеПароль.Видимость 		= УстановитеПарольВидимость;
		Элементы.ГруппаОжиданиеПроверки.Видимость 		= Ложь;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		РезультатПроверки = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Элементы.НадписьОшибка.Подсказка = "Возникла ошибка при проверке пользователя. Попробуйте позже!";
		Элементы.ГруппаОжиданиеПроверкиОшибка.Видимость = Истина; 
		
		Если ТипЗнч(РезультатПроверки) = Тип("Структура") Тогда
			Если РезультатПроверки.Свойство("ТекстОшибки") Тогда
				Элементы.НадписьОшибка.Подсказка = РезультатПроверки.ТекстОшибки;
			КонецЕсли;  
		КонецЕсли;  
		
	КонецЕсли; 
	
	РазблокироватьДанныеФормыДляРедактирования();
	
КонецПроцедуры

 &НаКлиенте
Процедура ЭтоНужныйПользователь(Команда) 
	 
	МожноЗаписатьПользователя 		= истина;
	Объект.ИдентифкаторПользователя = ИдентифкаторПользователя; 
	
	Элементы.ГруппаПользовательСуществует.Видимость = Ложь;
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеПользователя()
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(Объект.ИдентифкаторПользователя));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_userinfo", СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если Ответ.КодСостояния = 200 Тогда
		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
	
		АктивныйПользователь				= XMLЗначение(Тип("Булево"), СтруктураJSON.activeuser);
		ИспользуетсяAPI						= XMLЗначение(Тип("Булево"), СтруктураJSON.usedapi);
		ПотребоватьСменыПароляПриВходе 		= XMLЗначение(Тип("Булево"), СтруктураJSON.requirepasswordchange);   
		ПарольУстановлен 					= XMLЗначение(Тип("Булево"), СтруктураJSON.passwordset);   
		РазрешенДоступПоAPI					= XMLЗначение(Тип("Булево"), СтруктураJSON.allowedapi);
		КлючДоступаAPI						= XMLЗначение(Тип("Строка"), СтруктураJSON.keyapi); 
		ТребуетсяУведомлениеПоРегламенту	= XMLЗначение(Тип("Булево"), СтруктураJSON.tasks);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешенДоступПоAPIПриИзменении(Элемент)
	УправлениеЭлементамиФормы(); 
КонецПроцедуры  

&НаКлиенте
Процедура НастроитьРасписание(Команда)  
	
	ТекущиеДанные = Элементы.ДоступныеПрофили.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТипЗнч(ТекущиеДанные.Профиль) <> Тип("СправочникСсылка.CW_ВебПрофили") Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать мастер-профиль");
		Возврат;		
	Конецесли;
	
	ТребуетсяУведомлениеПоРегламенту = Истина;
	УстановитьОформлениеКнопки(Истина);
	
	ТекущаяСтрока = Элементы.ДоступныеПрофили.ТекущаяСтрока;
	МассивПрофилей = ПолучитьМассивПрофилей(ТекущаяСтрока);	
	Если МассивПрофилей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Отсутствуют доступные профили!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь",    	Объект.Ссылка);
	ПараметрыФормы.Вставить("ОсновнойПрофиль",  ТекущиеДанные.Профиль);
	ПараметрыФормы.Вставить("МассивПрофилей",  	МассивПрофилей);
	ПараметрыФормы.Вставить("Язык",  			СокрЛП(Объект.Язык));
	
	ОткрытьФорму("Справочник.CW_ВебПользователиЛКК.Форма.НастройкиЗаданияОтправки", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьОформлениеКнопки(ПроверкаВыполнена)
	
	Элементы.ДоступныеПрофилиНастроитьРасписание.ЦветТекста = ?(ПроверкаВыполнена, Новый Цвет, ЦветаСтиля.ЦветОсобогоТекста);   
	Элементы.ДоступныеПрофилиНастроитьРасписание.ЦветФона 	= ?(ПроверкаВыполнена, Новый Цвет, Новый Цвет(255,255,0));  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПрофилей(ТекущаяСтрока) 

	Массив = Новый Массив;
	
	СтрокаТекущая = ДоступныеПрофили.НайтиПоИдентификатору(ТекущаяСтрока);
	ЭлементыДерева = СтрокаТекущая.ПолучитьЭлементы();
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.Профиль = "ГРУЗОПЕРЕВОЗКИ" Тогда
			ИдентификаторСтрокиРаздела = ЭлементДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если ИдентификаторСтрокиРаздела = Неопределено Тогда
		Возврат Массив;
	КонецЕсли;
	
	СтрокаРаздела= ДоступныеПрофили.НайтиПоИдентификатору(ИдентификаторСтрокиРаздела);
	ЭлементыРаздела = СтрокаРаздела.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыРаздела Цикл
		Если СтрокаДерева.Использование = 1 Тогда
			Массив.Добавить(СтрокаДерева.Профиль);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если УстановленНовыйПароль Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВременныйПароль", ВременныйПароль);
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("АктивныйПользователь", 			АктивныйПользователь);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешенДоступПоAPI", 			РазрешенДоступПоAPI);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПотребоватьСменыПароляПриВходе",	ПотребоватьСменыПароляПриВходе);
	
КонецПроцедуры
